app/views/lists/show.html.erb

SELECT COUNT(*) FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 1]]
---
  </div>
  <span class="movie-tag"><%= pluralize(@list.movies.size, "movie") %></span>

SELECT 1 AS one FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1 LIMIT $2  [["list_id", 1], ["LIMIT", 1]]
---
  <div class="d-flex justify-content-between my-4">
    <span class="mb-2 d-block"><small><em class="text-muted"><%= "You haven't saved any movies yet!" if @list.movies.empty? %></em></small></span>

SELECT "movies".* FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."list_id" = $1 AND "bookmarks"."movie_id" = $2 LIMIT $3  [["list_id", 1], ["movie_id", 5], ["LIMIT", 1]]
---
  <div class="row my-2">
    <% @list.movies.each do |movie| %>
      <% bookmark = Bookmark.find_by(list: @list, movie: movie) %>

SELECT 1 AS one FROM "reviews" WHERE "reviews"."list_id" = $1 LIMIT $2  [["list_id", 1], ["LIMIT", 1]]
---
      <h3>Reviews</h3>
      <% if @list.reviews.empty? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."list_id" = $1  [["list_id", 1]]
---
      <% end %>
      <% @list.reviews.each do |review| %>